
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивТикеров = ОбщегоНазначенияСервер.ПолучитьМассивТикеров();
	Элементы.СоставПортфеляТикер.СписокВыбора.ЗагрузитьЗначения(МассивТикеров);
	
КонецПроцедуры

&НаКлиенте
Процедура МетапортфельПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	ЭтоМетапортфель = Объект.Метапортфель;
	Элементы.СтраницаСоставПортфеля.Видимость = (НЕ ЭтоМетапортфель);
	Элементы.СтраницаСоставМетапортфеля.Видимость = ЭтоМетапортфель;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

