
Процедура ПередЗаписью(Отказ)
	
	Если Метапортфель Тогда
		СоставПортфеля.Очистить();
		СоставМетапортфеля.Сортировать("Дата");
	Иначе 
		СоставМетапортфеля.Очистить();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Метапортфель Тогда
		Для Каждого СтрокаТабЧасти Из СоставМетапортфеля Цикл
			Если СтрокаТабЧасти.Портфель.Метапортфель Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Использование вложенных метапортфелей не поддерживается!",,,, Отказ);
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры
